app/controllers/api/v1/items_controller.rb

SELECT "items".* FROM "items" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"
---
  def index
    @items = paginate Item.all

INSERT INTO "items" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "english"], ["description", "this is  subject."], ["created_at", "2024-06-10 11:11:57.691886"], ["updated_at", "2024-06-10 11:11:57.691886"]]
---
  def create
    @item = Item.new(item_params)
    if @item.save

UPDATE "items" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "items"."id" = $4  [["name", "engledit1"], ["description", "edit1  subject."], ["updated_at", "2024-06-10 11:11:57.759020"], ["id", 92]]
---
  def update
    if @item.update(item_params)

DELETE FROM "items" WHERE "items"."id" = $1  [["id", 122]]
---
  def destroy
    unless @item.destroy