app/controllers/api/v1/admin/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."created_at" BETWEEN $1 AND $2  [["created_at", "2024-06-01 00:00:00"], ["created_at", "2024-06-30 23:59:59.999999"]]
---
    def index
        if params[:start_date].present? && params[:end_date].present?
            start_date = parse_date(params[:start_date])
            end_date = parse_date(params[:end_date])
        else
            start_date = Date.current.beginning_of_month
            end_date = Date.current.end_of_month
        end
        @tasks = Task.where(created_at: start_date.beginning_of_day..end_date.end_of_day)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."created_at" BETWEEN $1 AND $2  [["created_at", "2024-06-01 00:00:00"], ["created_at", "2024-06-30 23:59:59.999999"]]
---
    def show
        if params[:id]
          @task = Task.find(id)